-- MySQL dump 10.13  Distrib 5.7.38, for Win64 (x86_64)
--
-- Host: localhost    Database: punch
-- ------------------------------------------------------
-- Server version	5.7.38

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Dumping data for table `checkin_template`
--

LOCK TABLES `checkin_template` WRITE;
/*!40000 ALTER TABLE `checkin_template` DISABLE KEYS */;
INSERT INTO `checkin_template` (`id`, `template_name`, `description`, `parent_id`, `status`, `create_by`, `create_time`, `update_by`, `update_time`, `lottery_reward`) VALUES (1,'娴嬭瘯 11','娴嬭瘯',NULL,1,1,'2025-08-23 08:13:14',1,'2025-08-23 08:31:14',0),(2,'姣忔棩鎵撳崱-鍞愬畤杞?,'',2,1,2,'2025-08-23 15:31:30',2,'2026-04-04 22:23:22',2),(3,'姣忔棩鎵撳崱-鍞愯鏅?,'',2,1,2,'2025-08-24 10:56:36',2,'2026-04-05 17:26:40',2),(4,'瀛︿範鎵撳崱','鍦ㄥ涔犱腑杩涜鎵撳崱',3,1,3,'2025-08-24 16:45:58',3,'2025-08-24 17:01:58',0);
/*!40000 ALTER TABLE `checkin_template` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `checkin_item`
--

LOCK TABLES `checkin_item` WRITE;
/*!40000 ALTER TABLE `checkin_item` DISABLE KEYS */;
INSERT INTO `checkin_item` (`id`, `template_id`, `item_name`, `description`, `points`, `sort_order`, `status`, `create_time`, `update_time`, `checkin_start_time`, `checkin_end_time`, `week_days`) VALUES (1,1,'鏅ㄨ2','ddd',20,1,1,'2025-08-23 08:30:46','2025-08-23 08:40:48','23:00:00','23:09:00',127),(6,2,'姣忔棩璺戞','',10,1,0,'2025-08-24 10:35:14','2026-04-05 17:09:11','06:30:00','06:45:00',31),(14,2,'璁板繂(鏃╀笂)','',5,1,0,'2025-08-24 10:52:57','2026-04-05 17:10:13','06:45:00','07:30:00',127),(17,3,'姣忔棩璺戞','',10,1,0,'2025-08-24 10:57:35','2026-04-05 17:27:19','06:30:00','07:00:00',127),(18,3,'璁板繂(鏃╀笂)','',15,2,0,'2025-08-24 10:59:08','2025-08-24 10:59:08','06:50:00','07:20:00',127),(19,3,'鏁板鍙ｇ畻','',20,3,0,'2025-08-24 10:59:55','2026-04-05 17:29:20','09:00:00','09:30:00',96),(20,3,'缁冨瓧','',20,5,0,'2025-08-24 11:01:18','2026-04-05 17:31:15','09:30:00','10:30:00',96),(23,3,'璁板繂(涓嬪崍)','',15,7,0,'2025-08-24 11:05:20','2025-08-24 11:05:20','16:30:00','17:00:00',127),(24,4,'鏃╄','',10,1,0,'2025-08-24 16:47:07','2025-08-24 16:47:07','08:00:00','08:00:00',127),(25,4,'鍐欎綔涓?,'',30,2,0,'2025-08-24 16:47:35','2025-08-24 16:47:35','09:00:00','12:00:00',127),(26,4,'鍚冩櫄楗?,'',1,3,0,'2025-08-24 16:53:08','2025-08-24 16:53:08','20:00:00','21:00:00',127),(27,2,'鏃╄','',20,3,0,'2026-04-05 17:11:32','2026-04-05 17:11:31','06:45:00','07:30:00',31),(28,2,'瀛︽牎浣滀笟','',15,4,0,'2026-04-05 17:13:18','2026-04-05 17:13:18','16:00:00','18:00:00',31),(29,2,'涓嬪崍璁板繂','',10,5,0,'2026-04-05 17:15:28','2026-04-05 17:15:27','16:00:00','18:15:00',127),(30,2,'缁冨瓧','',15,6,0,'2026-04-05 17:16:27','2026-04-05 17:34:14','18:00:00','18:50:00',31),(31,2,'鏅氫笂娲楁急','',10,7,0,'2026-04-05 17:18:11','2026-04-05 17:18:11','20:00:00','20:30:00',127),(32,2,'鍙ｇ畻涔樻硶','',15,8,0,'2026-04-05 17:19:47','2026-04-05 17:19:47','17:00:00','18:00:00',127),(33,2,'鍙ｇ畻涔樻硶','',15,9,0,'2026-04-05 17:21:26','2026-04-05 17:21:26','08:30:00','10:00:00',96),(34,2,'浠诲姟鎶芥煡','',10,10,0,'2026-04-05 17:24:10','2026-04-05 17:24:10','08:00:00','08:30:00',31),(35,2,'缁冨瓧','',15,11,0,'2026-04-05 17:26:15','2026-04-05 17:26:15','10:00:00','10:30:00',96),(36,3,'鏅ㄨ','',15,4,0,'2026-04-05 17:28:11','2026-04-05 17:28:46','06:45:00','07:20:00',127),(37,3,'浠诲姟鎶芥煡','',15,8,0,'2026-04-05 17:32:11','2026-04-05 17:32:11','20:00:00','20:30:00',31),(38,3,'鏅氫笂娲楁急','',15,9,0,'2026-04-05 17:32:53','2026-04-05 17:32:53','20:00:00','20:30:00',127),(39,3,'鏁板鍙ｇ畻','',20,10,0,'2026-04-05 17:33:54','2026-04-05 17:33:54','17:00:00','18:00:00',31),(40,3,'瀛︽牎浣滀笟','',20,11,0,'2026-04-05 17:35:14','2026-04-05 17:35:14','16:00:00','18:00:00',31);
/*!40000 ALTER TABLE `checkin_item` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-04-05 17:43:13
